# =======================================================
# Общая информация о курсе
# =======================================================

# -------------------------------------------------------
# 1.4. Глоссарий
# -------------------------------------------------------

# -------------------------------------------------------
# Сопоставьте термины и их значения:

# Handler - Функция-обработчик
# FSM - Машина состояний
# API - Программный интерфейс приложения
# Throttling - Ограничение пропускной способности
# Deploy - Развертывание
# Middleware - Промежуточное ПО
# Polling - Опрос сервера



# =======================================================
# Общие сведения о телеграмм-ботах
# =======================================================

# -------------------------------------------------------

# ЦИКЛ ВЗАИМОДЕЙСТВИЯ

# Есть две основные технологии, которыми бот может получать то, что ему предназначено от сервера. Long polling и
# Webhook. Суть лонг поллинга состоит в том, чтобы постоянно опрашивать сервер на наличие обновлений (апдейтов),
# предназначенных боту, типа, "Есть, там, чего для меня?". А webhook - это когда сам сервер "стучится" к боту и
# говорит: "Тебе что-то пришло!", когда для бота что-то приходит. Сейчас не будем заострять на этих технологиях
# внимание, о них будет подробно далее в курсе. Long polling используется, в основном, на этапе разработки и
# тестирования бота, часто на компьютере самого разработчика, а webhook, когда бот уже запущен в продакшн.


