# =======================================================
# Общая информация о курсе
# =======================================================

# -------------------------------------------------------
# 1.4. Глоссарий
# -------------------------------------------------------

# -------------------------------------------------------
# Сопоставьте термины и их значения:

# Handler - Функция-обработчик
# FSM - Машина состояний
# API - Программный интерфейс приложения
# Throttling - Ограничение пропускной способности
# Deploy - Развертывание
# Middleware - Промежуточное ПО
# Polling - Опрос сервера



# =======================================================
# Общие сведения о телеграмм-ботах
# =======================================================

# -------------------------------------------------------

# ЦИКЛ ВЗАИМОДЕЙСТВИЯ

# Есть две основные технологии, которыми бот может получать то, что ему предназначено от сервера. Long polling и
# Webhook. Суть лонг поллинга состоит в том, чтобы постоянно опрашивать сервер на наличие обновлений (апдейтов),
# предназначенных боту, типа, "Есть, там, чего для меня?". А webhook - это когда сам сервер "стучится" к боту и
# говорит: "Тебе что-то пришло!", когда для бота что-то приходит. Сейчас не будем заострять на этих технологиях
# внимание, о них будет подробно далее в курсе. Long polling используется, в основном, на этапе разработки и
# тестирования бота, часто на компьютере самого разработчика, а webhook, когда бот уже запущен в продакшн.


# Сопоставьте названия команд с функционалом, который они активируют:
# Сопоставьте значения из двух списков

# /setabouttext - Изменение информации о боте в его профиле
# /setinline - Включение инлайн-режима для бота
# /setprivacy - Изменение режима видимости сообщений ботом в группах
# /setdescription - Изменение описания бота, которое пользователь видит перед стартом бота
# /revoke - Перевыпуск токена бота
# /setjoingroups - Разрешение или запрет добавлять бота в группы


# Выберите стандартный путь для отслеживаемого гитом файла.

# - Работаем с файлом - добавляем файл в индекс - коммитим изменения







